### Terraform Plan Summary
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.athena.aws_athena_database.stock_db will be created
  + resource "aws_athena_database" "stock_db" {
      + bucket        = "data-analytics-dev-athena-results"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "analytics_db"
    }

  # module.athena.aws_athena_named_query.recent will be created
  + resource "aws_athena_named_query" "recent" {
      + database    = "analytics_db"
      + description = "Fetch recent stock records"
      + id          = (known after apply)
      + name        = "recent-stock-records"
      + query       = "SELECT * FROM stocks_table LIMIT 10;"
      + workgroup   = "primary"
    }

  # module.dynamo.aws_dynamodb_table.processed will be created
  + resource "aws_dynamodb_table" "processed" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "pk"
      + id               = (known after apply)
      + name             = "stock-processed-dev"
      + range_key        = "sk"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "stock-processed-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Processed stock data"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "stock-processed-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Processed stock data"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "pk"
          + type = "S"
        }
      + attribute {
          + name = "sk"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.glue.aws_glue_catalog_database.stocks will be created
  + resource "aws_glue_catalog_database" "stocks" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "stock_db_dev"
      + tags_all     = (known after apply)

      + create_table_default_permission (known after apply)
    }

  # module.glue.aws_glue_crawler.stock_crawler will be created
  + resource "aws_glue_crawler" "stock_crawler" {
      + arn           = (known after apply)
      + database_name = "stock_db_dev"
      + id            = (known after apply)
      + name          = "stock-crawler-dev"
      + role          = (known after apply)
      + schedule      = "cron(0/15 * * * ? *)"
      + tags          = {
          + "Environment" = "dev"
          + "Name"        = "stock-crawler-dev"
          + "Project"     = "data-analytics"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Name"        = "stock-crawler-dev"
          + "Project"     = "data-analytics"
        }

      + s3_target {
          + path = "s3://data-analytics-dev-raw/"
        }
    }

  # module.iam.data.aws_iam_policy_document.glue_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.iam.aws_iam_policy.glue_policy will be created
  + resource "aws_iam_policy" "glue_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-glue-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.glue_exec will be created
  + resource "aws_iam_role" "glue_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-glue-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.lambda_ingest will be created
  + resource "aws_iam_role" "lambda_ingest" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-lambda-ingest-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.lambda_producer will be created
  + resource "aws_iam_role" "lambda_producer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-producer-exec-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = "dev-lambda-ingest-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.glue_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "glue_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-glue-exec-role"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-producer-exec-dev"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_kinesis will be created
  + resource "aws_iam_role_policy_attachment" "lambda_kinesis" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonKinesisFullAccess"
      + role       = "lambda-producer-exec-dev"
    }

  # module.kinesis.aws_kinesis_stream.stock_stream will be created
  + resource "aws_kinesis_stream" "stock_stream" {
      + arn                       = (known after apply)
      + encryption_type           = "NONE"
      + enforce_consumer_deletion = false
      + id                        = (known after apply)
      + name                      = "dev-stock-stream"
      + retention_period          = 24
      + shard_count               = 1
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "stock-stream-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Ingest stock data"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Name"        = "stock-stream-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Ingest stock data"
        }

      + stream_mode_details (known after apply)
    }

  # module.lambda_ingest.aws_lambda_event_source_mapping.kinesis_to_lambda will be created
  + resource "aws_lambda_event_source_mapping" "kinesis_to_lambda" {
      + arn                           = (known after apply)
      + batch_size                    = 100
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.lambda_ingest.aws_lambda_function.ingest will be created
  + resource "aws_lambda_function" "ingest" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-stock-ingest"
      + handler                        = "app.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + s3_bucket                      = "data-analytics-dev-artifacts"
      + s3_key                         = "lambda/function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Name"        = "stock-ingest-dev"
          + "Project"     = "data-analytics"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Name"        = "stock-ingest-dev"
          + "Project"     = "data-analytics"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DDB_TABLE"  = "stock-processed-dev"
              + "RAW_BUCKET" = "data-analytics-dev-raw"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_producer.aws_cloudwatch_event_rule.every_minute will be created
  + resource "aws_cloudwatch_event_rule" "every_minute" {
      + arn                 = (known after apply)
      + description         = "Triggers stock producer Lambda every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-invoke-stock-producer"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags_all            = (known after apply)
    }

  # module.lambda_producer.aws_cloudwatch_event_target.invoke_lambda will be created
  + resource "aws_cloudwatch_event_target" "invoke_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "dev-invoke-stock-producer"
      + target_id      = "stock-producer"
    }

  # module.lambda_producer.aws_lambda_function.stock_producer will be created
  + resource "aws_lambda_function" "stock_producer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-stock-producer"
      + handler                        = "stock_producer.main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + s3_bucket                      = "data-analytics-dev-artifacts"
      + s3_key                         = "lambda/stock_producer.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-stock-producer"
          + "Project"     = "data-analytics"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-stock-producer"
          + "Project"     = "data-analytics"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGION"      = "us-east-1"
              + "STREAM_NAME" = "dev-stock-stream"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_producer.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-stock-producer"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.lambda_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "lambda-ingest-errors-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "dev-stock-ingest"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "lambda-ingest-errors-dev"
          + "Project"     = "data-analytics"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "lambda-ingest-errors-dev"
          + "Project"     = "data-analytics"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_sns_topic.alerts_topic will be created
  + resource "aws_sns_topic" "alerts_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "stock-alerts-dev"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "stock-alerts-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Alert notifications for stock pipeline"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "stock-alerts-dev"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Alert notifications for stock pipeline"
        }
      + tracing_config              = (known after apply)
    }

  # module.monitoring.aws_sns_topic_subscription.email_subscription will be created
  + resource "aws_sns_topic_subscription" "email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alerts@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.s3.aws_s3_bucket.artifacts will be created
  + resource "aws_s3_bucket" "artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "data-analytics-dev-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-artifacts"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Lambda/Glue artifacts"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-artifacts"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Lambda/Glue artifacts"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket.athena_results will be created
  + resource "aws_s3_bucket" "athena_results" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "data-analytics-dev-athena-results"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-results"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Athena query results"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-results"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Athena query results"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket.raw will be created
  + resource "aws_s3_bucket" "raw" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "data-analytics-dev-raw"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-raw"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Raw ingestion data"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "stock-pipeline-raw"
          + "Project"     = "data-analytics"
          + "Purpose"     = "Raw ingestion data"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.

```